; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	infrared0 - mode
	infrared2 - mode
	thermograph3 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation7 - direction
	Star6 - direction
	GroundStation8 - direction
	GroundStation4 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation9 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph3)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star6)
	(supports instrument2 thermograph3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star6)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument4 thermograph3)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument6 thermograph3)
	(supports instrument6 infrared0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared2)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 GroundStation9)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet14)
)
(:goal (and
	(have_image Star10 thermograph1)
	(have_image Star11 thermograph3)
	(have_image Star12 infrared0)
	(have_image Phenomenon13 infrared2)
	(have_image Planet14 infrared2)
	(have_image Star15 thermograph1)
))

)

; plan
1. (turn_to satellite3 groundstation2 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 groundstation2)
   goals met: 0 of 6
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 6
3. (calibrate satellite3 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 6
4. (turn_to satellite3 star11 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star11)
   goals met: 0 of 6
5. (take_image satellite3 star11 instrument6 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 1 of 6
6. (turn_to satellite3 planet14 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 planet14)
   goals met: 1 of 6
7. (take_image satellite3 planet14 instrument6 infrared2)
   added: (have_image planet14 infrared2)
   goals met: 2 of 6
8. (turn_to satellite3 phenomenon13 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 phenomenon13)
   goals met: 2 of 6
9. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 6
10. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 2 of 6
11. (take_image satellite3 phenomenon13 instrument6 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 3 of 6
12. (turn_to satellite2 star10 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star10)
   goals met: 3 of 6
13. (take_image satellite2 star10 instrument4 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 4 of 6
14. (turn_to satellite2 star15 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star15)
   goals met: 4 of 6
15. (take_image satellite2 star15 instrument4 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 5 of 6
16. (turn_to satellite3 star12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 star12)
   goals met: 5 of 6
17. (take_image satellite3 star12 instrument6 infrared0)
   added: (have_image star12 infrared0)
   goals met: 6 of 6
